"LAST_BACKUP" = "Varmuuskopioitu viimeksi:";
"NEXT_BACKUP" = "Seuraava varmuuskopiointi:";
"BACKING_UP" = "Varmuuskopioidaan:";
"ACCESSING_BACKUP" = "Käytetään varmuuskopiolevyä…";
"IN_PROGRESS" = "Varmuuskopioidaan…";
"PREPARING" = "Valmistellaan varmuuskopiointia…";
"STOPPING" = "Lopetetaan varmuuskopiointia…";
"THINNING" = "Viimeistellään…";
"DELETING" = "Poistetaan vanhoja varmuuskopioita…";
"FINISHING" = "Viimeistellään varmuuskopiointia…";
"EXCLUDE" = "Ohita";
"NOT_MOUNTED" = "Varmuuskopiotaltiota ei ole tuotu näkyviin.";
"INCLUDED" = "Täyden varmuuskopion arvioitu koko: %@";
"CALCULATING" = "Lasketaan täyden varmuuskopion kokoa…";
"ENCRYPT_IMAGE_NAME" = "Varmuuskopio %@%@";
"DI_ERR_TITLE" = "Salattua varmuuskopiolevytiedosta luotaessa tapahtui virhe.";
"DI_EXISTS" = "Levyllä on jo salattu varmuuskopio.";
"DI_ERROR" = "Tapahtui virhe %d";
"DI_FAILED_TO_MOUNT" = "Levytiedostoa ei voitu tuoda näkyviin.";
"OK" = "OK";
"SHOW_HIDDEN_ITEMS" = "Näytä näkymättömät kohteet"; // checkbox
"CALCULATING_SIZE" = "Lasketaan muutoksia…";
"CALCULATING_CHANGED_ITEMS" = "Valmistellaan %@ kohdetta…";					
"CALCULATING_EXCLUDED_ITEMS" = "Ohitetaan %@ kohdetta…";
"CALCULATING_DEEP_SCANNED_ITEMS" = "Skannataan %@ kohdetta…";

"MOUNTING" = "Otetaan käyttöön varmuuskopiolevyä…";
"INDEXING" = "Indeksoidaan varmuuskopiota…";

// voice-over strings
"AX_ADD" = "Lisää kohde Älä varmuuskopioi -luetteloon";
"AX_REMOVE" = "Poista kohde Älä varmuuskopioi -luettelosta";

// error strings
"FAILED" = "Epäonnistui";
"DELAYED" = "Viivästynyt";
"TIME_MACHINE_ERROR" = "Time Machine -virhe";

"WARNING_SAME_DISK_TITLE" = "Haluatko varmasti varmuuskopioida samalle laitteelle, jolla alkuperäiset tiedostot ovat?";
"WARNING_SAME_DISK_ONE_CONFLICT" = "Taltio ”%@”, jonka valitsit varmuuskopioiden tallentamiseen, on samalla laitteella kuin varmuuskopioitava taltio ”%@”.\n\nJotta tiedot olisivat mahdollisimman hyvässä suojassa, kannattaa ne varmuuskopioida eri laitteella olevalle taltiolle.\n";
"WARNING_SAME_DISK_MULTIPLE_CONFLICTS" = "Taltio ”%@”, jonka valitsit varmuuskopioiden tallentamiseen, on samalla laitteella kuin varmuuskopioitavat taltiot ”%@” ja ”%@”.\n\nJotta tiedot olisivat mahdollisimman hyvässä suojassa, kannattaa ne varmuuskopioida eri laitteella olevalle taltiolle.\n";
"QUOTED_VOLUME_NAME" = "”%@”";
"LIST_SEPARATOR" = ", ";
"USE_SELECTED_DISK_BUTTON" = "Käytä valittua taltiota";
"CHOOSE_ANOTHER_DISK_BUTTON" = "Valitse toinen taltio";

"WARNING_NO_DESTINATION_TITLE" = "Varmuuskopiotaltiota ei ole valittu.\n\n";
"WARNING_NO_DESTINATION" = "Valitse varmuuskopiotaltio osoittamalla Määrittele.";

"REMAINING_HOUR" = "%d tunti";
"REMAINING_HOURS" = "%d tuntia";
"REMAINING_MIN" = "%d minuutti";	
"REMAINING_MINS" = "%d minuuttia";
"REMAINING_HOURS_AND_MINS" = "%@ ja %@ jäljellä…";
"REMAINING_ABOUT" = "%@ jäljellä…";
"REMAINING_LESS_MIN" = "Alle minuutti jäljellä…";

"BACKUP_NOW" = "Varmuuskopioi nyt";
"STOP_BACKING_UP" = "Lopeta varmuuskopiointi";
"BYTES_COMPLETED_AND_TOTAL_FORMAT" = "%1$@ / %2$@";

// disk formatting dialog
"DISK_NEEDS_REFORMATTING_TITLE" = "Haluatko varmasti tyhjentää varmuuskopiolevyn ”%@”? Tyhjentäminen poistaa kaikki levyllä olevat tiedot eikä sitä voida perua.";
"DISK_NEEDS_REFORMATTING_TEXT" = "Levy on tyhjennettävä ennen kuin sitä voidaan käyttää Time Machine -varmuuskopioita varten, koska sillä on epäyhteensopiva tiedostojärjestelmä.";
"DISK_NEEDS_REFORMATTING_CS_TEXT" = "Levy on tyhjennettävä ennen kuin sitä voidaan käyttää Time Machine -varmuuskopioita varten, koska varmuuskopioitava levy on isot ja pienet kirjaimet erotteleva, mutta varmuuskopiolevy ei ole.";
"ERASE_DISK_BUTTON" = "Tyhjennä";
"DONT_ERASE_BUTTON" = "Älä tyhjennä";
"CANCEL_ERASE_BUTTON" = "Kumoa";
"FORMATTING" = "Tyhjennetään:";

// disk formatting error dialog
"ERROR_FORMATTING_TITLE" = "Tyhjennettäessä Time Machine -varmuuskopiolevyä ”%@” tapahtui virhe.";

// skip system files alart
"WARNING_SKIP_SYSTEM_FILES_TITLE" = "Olet valinnut Järjestelmä-kansion ohittamisen.";
"WARNING_SKIP_SYSTEM_FILES" = "Haluatko lisäksi ohittaa muita Mac OS X:n mukana asennettuja tiedostoja, kuten järjestelmäohjelmat ja UNIX-työkalut?";
"EXCLUDE_ALL_SYSTEM_FILES_BUTTON" = "Ohita kaikki järjestelmätiedostot";
"EXCLUDE_SYSTEM_FOLDER_ONLY_BUTTON" = "Ohita vain Järjestelmä-kansio";
"EXCLUDE_LIST_ALL_SYSTEM_FILES" = "Järjestelmätiedostot ja ohjelmat";
"EXCLUDE_LIST_CALCULATING_SIZE" = "Lasketaan kokoa";

// the name we give a disk after reformatting it for use with Time Machine
"REFORMATTED_DISK_NAME" = "Time Machine -varmuuskopiot"; 

// Disk selection list
"REFORMAT_REQUIRED" = "uudelleenalustus vaaditaan (epäyhteensopiva tiedostojärjestelmä)";
"REFORMAT_REQUIRED_CS" = "uudelleenalustus vaaditaan (isot ja pienet merkit erottelematon levy)";
"SERVER_INFO_FORMAT" = "kohteessa ”%@”";
"TIME_CAPSULE_ACCOUNT" = "Oma käyttäjätunnus";

"DISK_PICKER_NONE" = "Ei mitään";
"DISK_PICKER_NONE_TOOL_TIP" = "Pysäytä varmuuskopiointi";
"DISK_PICKER_BUTTON_USE" = "Käytä varmuuskopiointiin";
"DISK_PICKER_BUTTON_STOP" = "Lopeta varmuuskopiointi";

// Available disk space
"AVAILABLE_AND_TOTAL_DISK_SPACE_FORMAT" = "%@ / %@";

// FileVault warnings
"FILEVAULT_WARNING_USER_LEOPARD_TITLE" = "Tilillä on käytössä FileVault. Time Machine varmuuskopioi kotikansion vain, kun olet kirjautuneena sisään.";
"FILEVAULT_WARNING_USER_LEOPARD" = "Et voi selata tai palauttaa yksittäisiä kohteita Time Machine -varmuuskopiossa olevasta FileVault-suojatusta kotikansiosta. Jos haluat palauttaa kaikki tiedostot ja kansiot tämäntyyppisestä varmuuskopiosta, käynnistä tietokone Mac OS X -asennuslevyltä ja valitse asentajan Lisäohjelmat-valikosta Palauta järjestelmä varmuuskopiosta.";
"FILEVAULT_WARNING_ADMIN_LEOPARD_TITLE" = "Yhdellä tai useammalla tämän tietokoneen tilillä on käytössä FileVault. Time Machine varmuuskopioi FileVault-suojatut kotikansiot vain, kun ne omistavat käyttäjät ovat kirjautuneena sisään.";
"FILEVAULT_WARNING_ADMIN_LEOPARD" = "Et voi selata tai palauttaa yksittäisiä kohteita Time Machine -varmuuskopiossa olevasta FileVault-suojatusta kotikansiosta. Jos haluat palauttaa kaikki tiedostot ja kansiot tämäntyyppisestä varmuuskopiosta, käynnistä tietokone Mac OS X -asennuslevyltä ja valitse asentajan Lisäohjelmat-valikosta Palauta järjestelmä varmuuskopiosta.";

"FILEVAULT_WARNING_USER_TIGER_TITLE" = "Time Machine ei voi varmuuskopioida kotikansiota, koska se on salattu vanhalla FileVault-versiolla. Poista FileVault käytöstä tunnuksella ja ota se takaisin käyttöön ja yritä varmuuskopiointia uudelleen.";
"FILEVAULT_WARNING_ADMIN_TIGER_1_USER_TITLE" = "Time Machine ei voi varmuuskopioida tunnuksen ”%@” kotikansiota, koska se on salattu vanhalla FileVault-versiolla. Poista FileVault käytöstä tunnuksella ja ota se takaisin käyttöön ja yritä varmuuskopiointia uudelleen.";
"FILEVAULT_WARNING_ADMIN_TIGER_2_USERS_TITLE" = "Time Machine ei voi varmuuskopioida tunnusten ”%@” ja ”%@” kotikansioita, koska ne on salattu vanhalla FileVault-versiolla. Poista FileVault käytöstä ja ota se takaisin käyttöön kummallakin tunnuksella ja yritä varmuuskopiointia uudelleen.";
"FILEVAULT_WARNING_ADMIN_TIGER_3_USERS_TITLE" = "Time Machine ei voi varmuuskopioida tunnusten ”%@”, ”%@” ja ”%@” kotikansioita, koska ne on salattu vanhalla FileVault-versiolla. Poista FileVault käytöstä ja ota se takaisin käyttöön jokaisella tunnuksella ja yritä varmuuskopiointia uudelleen.";
"FILEVAULT_WARNING_ADMIN_TIGER_MORE_USERS_TITLE" = "Time Machine ei voi varmuuskopioida tunnusten ”%@”, ”%@”, ”%@” ja muiden kotikansioita, koska ne on salattu vanhalla FileVault-versiolla. Poista FileVault käytöstä ja ota se takaisin käyttöön jokaisella tunnuksella ja yritä varmuuskopiointia uudelleen.";
"FILEVAULT_WARNING_TIGER" = "Time Machine varmuuskopioi kotikansiot, jotka on suojattu FileVaultilla, mutta et voi selata tai palauttaa yksittäisiä kohteita Time Machine -varmuuskopiossa olevasta FileVault-suojatusta kotikansiosta. Jos haluat palauttaa kaikki tiedostot ja kansiot tämäntyyppisestä varmuuskopiosta, käynnistä tietokone Mac OS X -asennuslevyltä ja valitse asentajan Lisäohjelmat-valikosta Palauta järjestelmä varmuuskopiosta.";

"NEXT_BACKUP_WHEN_CONNECTED" = "Kun levy liitetään";
"NEXT_BACKUP_TURNED_OFF" = "Automaattiset varmuuskopiot pois";
"NEXT_BACKUP_WHEN_PLUGGED_IN" = "Kun Mac kytketään verkkovirtaan";

"WILL_START_IN_ONE_SEC" = "yksi sekunti…";
"WILL_START_IN_X_SECS" = "%@ sekuntia…";

"DESTINATION_TOOLTIP" = "Taltio: %@\nTuotu näkyviin kohdassa: %@";

"LATEST_SUCCESSFUL_BACKUP" = "Viimeisin onnistunut varmuuskopiointi: %@, %@";

"INSUFFICIENT_ACCESS_TITLE" = "Sinulla ei ole tarvittavia luku-, kirjoitus- ja lisäysoikeuksia valitulla verkkovarmuuskopiolevyllä.";
"INSUFFICIENT_ACCESS_MESSAGE" = "Muodosta yhteys toisena käyttäjänä tai ota yhteyttä verkon ylläpitäjään.";

"ERROR_OBTAINING_URL" = "Sisäinen virhe - osoitteen hakeminen kohteelle ”%@” epäonnistui";

"KEYCHAIN_ERROR" = "Tapahtui avainnippuvirhe %d luotaessa järjestelmän avainnipputietuetta käyttäjätunnukselle ”%@” ja osoitteelle ”%@”.";
"KEYCHAIN_RECOVERY_SUGGESTION" = "Käytä Avainnipun käyttö -ohjelmaa järjestelmän avainnipun muokkaamiseen tai korjaamiseen.";

"ERROR_NETAUTHMOUNT" = "Time Machine ei voi käyttää varmuuskopiolevyä ”%@”.";

"UNKNOWN_DISK_NAME" = "Nimetön";

// health check strings
PERFORMING_HEALTH_CHECK = "Tarkistetaan varmuuskopiota…";
SKIP_HEALTH_CHECK = "Ohita tarkistus";
SKIPPING_HEALTH_CHECK = "Ohitetaan tarkistusta…";
